src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойШаблонОбследований</Name>
					<Comment>Основной шаблон обследований</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОбследований</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПриемНесколькихПациентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СегментыНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяРучнаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПорядкиОкругления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПорядкиОкругления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Окр0_01</Name>
					<Comment>0.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_05</Name>
					<Comment>0.05</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_1</Name>
					<Comment>0.1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_5</Name>
					<Comment>0.5</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр5</Name>
					<Comment>5</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр10</Name>
					<Comment>10</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр50</Name>
					<Comment>50</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр100</Name>
					<Comment>100</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
					<Comment>Имущество организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
					<Comment>Упрощенная </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВидыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыЦен</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Comment>Истина - цена включает НДС, ложь - не включает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Comment>Порядок округления</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Comment>Истина, то при порядке округления "5" 0.01 будет округлена до 5, ложь - округление по арифметическим правилам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/Ценообразование/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
// Функция возвращает ставку НДС.
//
// Параметры:
//  СтавкаНДС - Ставка НДС.
//
// Возвращаемое значение:
//	Число.
//
Функция ПолучитьСтавкуНДС(СтавкаНДС) Экспорт

	Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС  Тогда
		Возврат 0;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС0  Тогда
		Возврат 0; 	
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10  Тогда
		Возврат 10;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18  Тогда
		Возврат 18;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20  Тогда
		Возврат 20;
	КонецЕсли;

	Возврат 0;

КонецФункции // ПолучитьСтавкуНДС()

&НаСервере  
// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения
//
// Параметры: 
//  Сумма            - число, сумма от которой надо рассчитывать налоги, 
//  СтавкаНДС        - число , процентная ставка НДС,
//
// Возвращаемое значение:
//  Число, полученная сумма НДС
//
Функция РассчитатьСуммуНДС(Сумма, СтавкаНДС) Экспорт

	Ставка = ПолучитьСтавкуНДС(СтавкаНДС);
	
	СуммаБезНДС = 100 * Сумма / (100 + Ставка);
	СуммаНДС    = Сумма - СуммаБезНДС; 		
	
	Возврат СуммаНДС;

КонецФункции // РассчитатьСуммуНДС()

&НаСервере
// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения.
//
// Параметры:
//  Сумма        - Число - сумма НДС
//  СтавкаНДС    - СправочникСсылка.СтавкиНДС - ссылка на ставку НДС.
//
// Возвращаемое значение:
//  Число        - пересчитанная сумма НДС.
//
Функция ПересчитатьСуммуПриИзмененииФлаговНДС(Сумма, СтавкаНДС) Экспорт
	
	Ставка = ПолучитьСтавкуНДС(СтавкаНДС);
	
	Сумма = (Сумма * (100 + Ставка)) / 100;
	
	Возврат Сумма;
	
КонецФункции // ПересчитатьСуммуПриИзмененииФлаговНДС()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

///////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПОДСИСТЕМЫ ЦЕНООБРАЗОВАНИЕ

&НаСервере
// Округляет число по заданному порядку.
//
// Параметры:
//  Число        - Число, которое необходимо округлить
//  ПорядокОкругления - Перечисления.ПорядкиОкругления - порядок округления
//  ОкруглятьВБольшуюСторону - Булево - округления в большую сторону.
//
// Возвращаемое значение:
//  Число        - результат округления.
//
Функция ОкруглитьЦену(Число, ПравилоОкругления, ОкруглятьВБольшуюСторону) Экспорт
	
	Перем Результат; // Возвращаемый результат.
	
	// Преобразуем порядок округления числа.
	// Если передали пустое значение порядка, то округлим до копеек. 
	Если НЕ ЗначениеЗаполнено(ПравилоОкругления) Тогда
		ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр0_01; 
	Иначе
		ПорядокОкругления = ПравилоОкругления;
	КонецЕсли;
	Порядок = Число(Строка(ПорядокОкругления));
	
	// вычислим количество интервалов, входящих в число
	КоличествоИнтервал	= Число / Порядок;
	
	// вычислим целое количество интервалов.
	КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервал);
	
	Если КоличествоИнтервал = КоличествоЦелыхИнтервалов Тогда
		
		// Числа поделились нацело. Округлять не нужно.
		Результат	= Число;
	Иначе
		Если ОкруглятьВБольшуюСторону Тогда
			
			// При порядке округления "0.05" 0.371 должно округлиться до 0.4
			Результат = Порядок * (КоличествоЦелыхИнтервалов + 1);
		Иначе
			
			// При порядке округления "0.05" 0.371 должно округлиться до 0.35,
			// а 0.376 до 0.4
			Результат = Порядок * Окр(КоличествоИнтервал, 0, РежимОкругления.Окр15как20);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОкруглитьЦену()

&НаСервере
// Возвращает цену Сертификата
// Если ТипНоменклатуры Не ПодарочныйСертификат возвращает Неопределено 
Функция ПолучитьЦенуСертификата(СтруктураДанных) Экспорт
	
	Если СтруктураДанных.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат И СтруктураДанных.ВидЦен <> Справочники.ВидыЦен.Закупочная Тогда
		
		Цена = СтруктураДанных.Номенклатура.Номинал;
		Если СтруктураДанных.Номенклатура.ВестиСерийныеНомера Тогда
			СтруктураДанных.Вставить("ВестиСерийныеНомера");
		КонецЕсли;
		
		Возврат Цена;	  
		
	КонецЕсли;
	
КонецФункции

&НаСервере
// Выполняет пересчет документа после изменений в форме "Цены и валюта".
//
// Возвращаемое значение:
//  Число        - Полученная цена номенклатуры по прайсу.
//
Функция ПолучитьЦенуНоменклатуры(СтруктураДанных) Экспорт
	
	Если СтруктураДанных.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат И СтруктураДанных.ВидЦен <> Справочники.ВидыЦен.Закупочная Тогда
		
		Если СтруктураДанных.Номенклатура.ВестиСерийныеНомера Тогда
			СтруктураДанных.Вставить("ВестиСерийныеНомера");
		КонецЕсли;
			
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаОбработки,
	|			Актуальность = ИСТИНА
	|				И Номенклатура = &Номенклатура
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент";

	
	Запрос.УстановитьПараметр("ДатаОбработки",	 	СтруктураДанных.ДатаОбработки);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктураДанных.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Номенклатура",	 	СтруктураДанных.Номенклатура);
	Запрос.УстановитьПараметр("ВидЦен",			 	СтруктураДанных.ВидЦен);
	Если СтруктураДанных.Свойство("Сотрудник") Тогда
		ЗапросСотрудникВидЦен = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                                     |	НастройкиСотрудников.ВидЦен
		                                     |ИЗ
		                                     |	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
		                                     |ГДЕ
		                                     |	НастройкиСотрудников.Сотрудник = &Сотрудник
		                                     |	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
		ЗапросСотрудникВидЦен.УстановитьПараметр("Сотрудник", СтруктураДанных.Сотрудник);
		ЗапросСотрудникВидЦен.УстановитьПараметр("СтруктурнаяЕдиница", СтруктураДанных.СтруктурнаяЕдиница);
		Выборка = ЗапросСотрудникВидЦен.Выполнить().Выбрать();
		Если Выборка.Следующий() и ЗначениеЗаполнено(Выборка.ВидЦен) Тогда
			Запрос.УстановитьПараметр("ВидЦен",	Выборка.ВидЦен);
		КонецЕсли;
		// И ЗначениеЗаполнено(СтруктураДанных.Сотрудник.ВидЦен) Тогда
		
	КонецЕсли;
	
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	
	Цена = ВозвратитьЦенуУпаковкиИзТаблицыЦен(ТаблицаЦен, Новый Структура("Упаковка", СтруктураДанных.Упаковка));
	
	// Учитываем: сумма включает НДС.
	Если НЕ СтруктураДанных.ВидЦен.ЦенаВключаетНДС И СтруктураДанных.Свойство("СтавкаНДС") Тогда
		Цена = ПересчитатьСуммуПриИзмененииФлаговНДС(Цена, СтруктураДанных.СтавкаНДС);
	КонецЕсли;
		
	Цена = ОкруглитьЦену(Цена, СтруктураДанных.ВидЦен.ПорядокОкругления, СтруктураДанных.ВидЦен.ОкруглятьВБольшуюСторону);
	
	Возврат Цена;
	
КонецФункции // ПолучитьЦенуНоменклатуры()

&НаСервере
// Выполняет пересчет документа после изменений в форме "Цены и валюта".
//
// Возвращаемое значение:
//  Число        - Полученная цена номенклатуры по прайсу.
//
Функция ВозвратитьЦенуУпаковкиИзТаблицыЦен(ТаблицаЦен, СтруктураПараметров) Экспорт
	
    ТаблицаЦенНоменклатуры = ТаблицаЦен.Скопировать();
	
	Если СтруктураПараметров.Свойство("Номенклатура") Тогда
		ТаблицаЦенНоменклатуры.Очистить();
		Для Каждого СтрокаТаблицыЦен Из ТаблицаЦен Цикл
			Если СтрокаТаблицыЦен.Номенклатура = СтруктураПараметров.Номенклатура Тогда
				НоваяСтрока = ТаблицаЦенНоменклатуры.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыЦен);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Цена = 0;

	// Если есть необходимая упаковка - берем ее цену, иначе - вычисляем
	Если ТаблицаЦенНоменклатуры.Найти(СтруктураПараметров.Упаковка, "Упаковка") <> Неопределено Тогда
		Цена = ТаблицаЦенНоменклатуры.Найти(СтруктураПараметров.Упаковка, "Упаковка").Цена;
	ИначеЕсли СтруктураПараметров.Упаковка.Пустая() И ТаблицаЦенНоменклатуры.Количество() > 0 Тогда
		Цена = ТаблицаЦенНоменклатуры[0].Цена / ?(ЗначениеЗаполнено(ТаблицаЦенНоменклатуры[0].Упаковка) , ТаблицаЦенНоменклатуры[0].Упаковка.Коэффициент, 1);
	ИначеЕсли Не СтруктураПараметров.Упаковка.Пустая() И ТаблицаЦенНоменклатуры.Найти(Справочники.УпаковкиНоменклатуры.ПустаяСсылка(), "Упаковка") <> Неопределено Тогда
		Цена = ТаблицаЦенНоменклатуры.Найти(Справочники.УпаковкиНоменклатуры.ПустаяСсылка(), "Упаковка").Цена * СтруктураПараметров.Упаковка.Коэффициент;
	КонецЕсли;
		
	Возврат Цена;
	
КонецФункции // ВозвратитьЦенуУпаковкиИзТаблицыЦен()

&НаСервере
// Выполняем пересчет цены табличной части документа после изменений в форме 
// "Цены и валюта".
//
// Параметры:
//  СтруктураРеквизитов - Структура реквизитов, необходимых при пересчете
//  ТабличнаяЧастьДокумента - ДанныеФормыСтруктура, содержит табличную часть
//                 документа.
//
Процедура ПолучитьЦеныТабличнойЧастиПоВидуЦен(СтруктураДанных, ТабличнаяЧастьДокумента) Экспорт
	
	// 1. Сформируем таблицу документа.
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	
	Массив = Новый Массив;
	
	// Номенклатура.
	Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив, ,);
	Массив.Очистить();
	
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", ОписаниеТипов);
	
	// СтавкиНДС.
	Массив.Добавить(Тип("ПеречислениеСсылка.СтавкиНДС"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив, ,);
	Массив.Очистить();
	
	ТаблицаНоменклатуры.Колонки.Добавить("СтавкаНДС", ОписаниеТипов);	
	
	// ЕдиницаИзмерения.
	Массив.Добавить(Тип("СправочникСсылка.УпаковкиНоменклатуры"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив, ,);
	Массив.Очистить();
	
	ТаблицаНоменклатуры.Колонки.Добавить("Упаковка", ОписаниеТипов);	
	
	Для каждого СтрокаТЧ Из ТабличнаяЧастьДокумента Цикл
		
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура	 = СтрокаТЧ.Номенклатура;
		НоваяСтрока.Упаковка = СтрокаТЧ.Упаковка;
		Если ТипЗнч(СтрокаТЧ) = Тип("Структура") И СтрокаТЧ.Свойство("СтавкаНДС") Тогда
			НоваяСтрока.СтавкаНДС		 = СтрокаТЧ.СтавкаНДС;
		КонецЕсли;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ТаблицаНоменклатуры.Номенклатура,
	|	ТаблицаНоменклатуры.Упаковка,
	|	ТаблицаНоменклатуры.СтавкаНДС
	|ПОМЕСТИТЬ ВременнаяТаблицаНоменклатуры
	|ИЗ
	|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры";
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	Запрос.Выполнить();
	
	ВидЦенПараметр = СтруктураДанных.ВидЦен;	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаОбработки,
	|			Актуальность = ИСТИНА
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент";
	
		
	Запрос.УстановитьПараметр("ДатаОбработки",	 	СтруктураДанных.Дата);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктураДанных.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ВидЦен",			 	ВидЦенПараметр);
	
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТабЧасти Из ТабличнаяЧастьДокумента Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура",	 СтрокаТабЧасти.Номенклатура);
		СтруктураПоиска.Вставить("Упаковка", 		 СтрокаТабЧасти.Упаковка);
		
		Цена = ВозвратитьЦенуУпаковкиИзТаблицыЦен(ТаблицаЦен, СтруктураПоиска);
		
		Если НЕ ВидЦенПараметр.ЦенаВключаетНДС и СтрокаТабЧасти.Свойство("СтавкаНДС") Тогда
			Цена = ПересчитатьСуммуПриИзмененииФлаговНДС(Цена, СтрокаТабЧасти.СтавкаНДС);
		КонецЕсли;
			
		СтрокаТабЧасти.Цена = ОкруглитьЦену(Цена, ВидЦенПараметр.ПорядокОкругления, ВидЦенПараметр.ОкруглятьВБольшуюСторону);
			
	КонецЦикла;
	
	МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры // ПолучитьЦеныТабличнойЧастиПоВидуЦен()

&НаСервере
// Получает набор данных с сервера для процедуры НоменклатураПриИзменении.
//
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные) Экспорт
	
	СтруктураДанные.Вставить("СтавкаНДС", ВернутьСтавкуНДС(СтруктураДанные));
	
	Если Не СтруктураДанные.Свойство("Упаковка") Тогда
		СтруктураДанные.Вставить("Упаковка", Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
	ИначеЕсли СтруктураДанные.Упаковка.Владелец <> СтруктураДанные.Номенклатура Тогда
		СтруктураДанные.Упаковка = Справочники.УпаковкиНоменклатуры.ПустаяСсылка();
	КонецЕсли;	
	
	Если СтруктураДанные.Свойство("ВидЦен")  Тогда
		Цена = ПолучитьЦенуНоменклатуры(СтруктураДанные);
		СтруктураДанные.Вставить("Цена", Цена);
	Иначе
		СтруктураДанные.Вставить("Цена", 0);
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

&НаСервере
// Функция возвращает ставку НДС
//
Функция ВернутьСтавкуНДС(СтруктураДанные)
	
	Если Не СтруктураДанные.Свойство("СтруктурнаяЕдиница")
		Или (СтруктураДанные.Свойство("СтруктурнаяЕдиница") И Не ЗначениеЗаполнено(СтруктураДанные.СтруктурнаяЕдиница)) Тогда
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	КонецЕсли;
	
	Организация = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтруктураДанные.СтруктурнаяЕдиница, "Организация");
	
	ДанныеОрганизации	= ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Организация,
								"СПриоритетомНоменклатуры, СтавкаНДС, СтавкаНДСДляАвансов, СистемаНалогообложенияДляТоваров, СистемаНалогообложенияДляАвансов");
	ДанныеНоменклатуры	= ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(СтруктураДанные.Номенклатура,
								"СтавкаНДС, ТипНоменклатуры");
	
	Если НЕ ДанныеОрганизации.СПриоритетомНоменклатуры 
		ИЛИ (ДанныеОрганизации.СПриоритетомНоменклатуры И Не ЗначениеЗаполнено(ДанныеНоменклатуры.СтавкаНДС)) Тогда
		
		Если ДанныеНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат
			И ЗначениеЗаполнено(ДанныеОрганизации.СтавкаНДСДляАвансов) Тогда
			
			СтавкаНДС = ДанныеОрганизации.СтавкаНДСДляАвансов; 
		Иначе
			СтавкаНДС = ДанныеОрганизации.СтавкаНДС;
		КонецЕсли;
		
	Иначе
		СтавкаНДС = ДанныеНоменклатуры.СтавкаНДС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтавкаНДС) Тогда
		Если ЗначениеЗаполнено(ДанныеОрганизации.СистемаНалогообложенияДляТоваров) Тогда 
			Если ДанныеОрганизации.СистемаНалогообложенияДляТоваров = Перечисления.СистемыНалогообложения.Общая Тогда 
				Возврат Перечисления.СтавкиНДС.НДС20;
			Иначе 
				Возврат Перечисления.СтавкиНДС.БезНДС;
			КонецЕсли;
		Иначе 
			Возврат Перечисления.СтавкиНДС.БезНДС;
		КонецЕсли;
	Иначе
		Возврат СтавкаНДС;
	КонецЕсли;   	
	
	// Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура.СтавкаНДС) Тогда 
	//	Возврат СтруктураДанные.Номенклатура.СтавкаНДС;
	// Иначе 
	//	Если ЗначениеЗаполнено(СтруктураДанные.СтруктурнаяЕдиница.Организация.СистемаНалогообложения) Тогда 
	//		Если СтруктураДанные.СтруктурнаяЕдиница.Организация.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая Тогда 
	//			Возврат Перечисления.СтавкиНДС.НДС20;
	//		Иначе 
	//			Возврат Перечисления.СтавкиНДС.БезНДС;
	//		КонецЕсли;
	//	Иначе 
	//		Возврат Перечисления.СтавкиНДС.БезНДС;
	//	КонецЕсли;
	// КонецЕсли;	
	
КонецФункции

&НаСервере
// Возвращает общую сумму документа без учета скидки
//
Функция ПолучитьСуммуДокументаБезСкидки(ТабличнаяЧасть) Экспорт

	СуммаДокумента = 0;	
	Для каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
		// Если это строка таблицы значений
		Если ТипЗнч(СтрокаТабличнойЧасти) = Тип("СтрокаТаблицыЗначений") Тогда
			ТВладелец = СтрокаТабличнойЧасти.Владелец();
			Если ТВладелец.Колонки.Найти("КоличествоУпаковок") <> Неопределено Тогда
				СуммаПоСтроке = Окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.КоличествоУпаковок, 2);
			Иначе
				СуммаПоСтроке = Окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество, 2);
			КонецЕсли;
		// Если это строка табличной части	
		Иначе	 
			СуммаПоСтроке = Окр(СтрокаТабличнойЧасти.Цена * ?(СтрокаТабличнойЧасти.Свойство("КоличествоУпаковок"),СтрокаТабличнойЧасти.КоличествоУпаковок,СтрокаТабличнойЧасти.Количество), 2);
		КонецЕсли;
		СуммаДокумента = СуммаДокумента + СуммаПоСтроке;
	КонецЦикла;

	Возврат СуммаДокумента;

КонецФункции // ПолучитьСуммуДокументаБезСкидки()

&НаСервере
// Выполняем пересчет цены табличной части документа после изменений в форме 
// "Цены и валюта".
//
Процедура ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ФормаДокумента, ИмяТабличнойЧасти, ПересчитатьСкидки = Ложь) Экспорт
	
	СтруктураДанных = Новый Структура;
	ТабличнаяЧастьДокумента = Новый Массив;

	СтруктураДанных.Вставить("Дата",				ФормаДокумента.Объект.Дата);
	СтруктураДанных.Вставить("СтруктурнаяЕдиница",	ФормаДокумента.Объект.СтруктурнаяЕдиница);
	СтруктураДанных.Вставить("ВидЦен",				ФормаДокумента.Объект.ВидЦен);
	
	// Если ПересчитатьСкидки Тогда
	//	СтруктураДанных.Вставить("ВидСкидкиНаценки", ФормаДокумента.Объект.ВидСкидкиНаценки);
	//	СтруктураДанных.Вставить("ПроцентСкидкиНаценки", 0);
	// КонецЕсли;
	
	Для каждого СтрокаТЧ Из ФормаДокумента.Объект[ИмяТабличнойЧасти] Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			Продолжить;	
		КонецЕсли; 
		
		СтрокаТабличнойЧасти = Новый Структура();
		СтрокаТабличнойЧасти.Вставить("Номенклатура",		СтрокаТЧ.Номенклатура);
		СтрокаТабличнойЧасти.Вставить("Упаковка",			СтрокаТЧ.Упаковка);
		Если СтрокаТЧ.Свойство("СтавкаНДС") Тогда
			СтрокаТабличнойЧасти.Вставить("СтавкаНДС",			СтрокаТЧ.СтавкаНДС);
		КонецЕсли;
		СтрокаТабличнойЧасти.Вставить("Цена",				0);
		
		ТабличнаяЧастьДокумента.Добавить(СтрокаТабличнойЧасти);
		
	КонецЦикла;
		
	Ценообразование.ПолучитьЦеныТабличнойЧастиПоВидуЦен(СтруктураДанных, ТабличнаяЧастьДокумента);
		
	Для каждого СтрокаТЧ Из ТабличнаяЧастьДокумента Цикл

		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура",		СтрокаТЧ.Номенклатура);
		СтруктураПоиска.Вставить("Упаковка",			СтрокаТЧ.Упаковка);
		Если СтрокаТЧ.Свойство("СтавкаНДС") Тогда 
			СтруктураПоиска.Вставить("СтавкаНДС",			СтрокаТЧ.СтавкаНДС);
		КонецЕсли;
		
		РезультатПоиска = ФормаДокумента.Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураПоиска);
		
		Для каждого СтрокаРезультат Из РезультатПоиска Цикл
			
			СтрокаРезультат.Цена = СтрокаТЧ.Цена;
			
			Если СтрокаРезультат.Свойство("Сумма") Тогда
				ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуТабЧасти(СтрокаРезультат);
			КонецЕсли;
			Если СтрокаРезультат.Свойство("СуммаНДС") Тогда
				ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуНДСТабЧасти(СтрокаРезультат);
			КонецЕсли;
			Если СтрокаРезультат.Свойство("Всего") Тогда
				ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуВКолонкеВсегоТабЧасти(СтрокаРезультат);
			КонецЕсли;			
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Если ПересчитатьСкидки Тогда
	//	Для каждого СтрокаТабличнойЧасти Из ФормаДокумента.Объект[ИмяТабличнойЧасти] Цикл
	//		СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = СтруктураДанных.ПроцентСкидкиНаценки;
	//		РассчитатьСуммуСтрокиТабличнойЧасти(ФормаДокумента, СтрокаТабличнойЧасти);
	//	КонецЦикла;
	// КонецЕсли;
	
КонецПроцедуры // ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен()

#КонецОбласти
